app/views/home/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
<% if article.user_id %>
<b><%=  User.find(article.user_id).username %></b>