app/views/home/my_articles.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
<% if article.user_id %>
<b><%=  User.find(article.user_id).username %></b>

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "walid.daboubi@gmail.com"]]
---

<% if User.find(article.user_id).email== session[:user_id] %>