app/controllers/article_controller.rb

  	def save
  		params[:article].permit! #replace attrb_accessible in rails 4
  		@article = Article.new(params[:article])
  		@article.user_id=User.find_by_email(session[:user_id]).id
  		@article.save
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "walid.daboubi@gmail.com"]]
INSERT INTO "articles" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "first article"], ["content", "this is my first article"], ["user_id", 1], ["created_at", "2015-05-01 12:54:44.358284"], ["updated_at", "2015-05-01 12:54:44.358284"]]

  	def edit
  		@article=Article.find(params[:article_id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 5]]

  	def update
  		#@article=params[:artcile]
  		params[:article].permit!
  		Article.update(params[:article][:id],params[:article])
---
UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "1er mai 2019"], ["updated_at", "2015-05-01 22:47:32.747430"], ["id", 5]]

  	def delete
  		Article.find(params[:article_id]).destroy
---
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 1]]
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]