app/controllers/home_controller.rb

SELECT "articles".* FROM "articles"
---
  def index
  	@article=Article.all

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "walid.daboubi@gmail.com"]]
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 1]]
---
  def my_articles
  	user_id=User.find_by_email(session[:user_id]).id
  	@my_articles=Article.where(:user_id => user_id)