app/controllers/user_controller.rb

	def new_session
		params[:user].permit! #replace attrb_accessible in rails 4
		@user=User.find_by_email(params[:user][:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "walid.daboubi@gmail.com"]]